
#+NAME: tab-lorenz-data
|  i |   y |   fy |   p |     L |
|----+-----+------+-----+-------|
|  0 |   0 |  0.0 |   0 |   0.0 |
|  1 |   3 |  1.9 |  10 |   1.9 |
|  2 |   7 |  4.5 |  20 |   6.5 |
|  3 |   8 |  5.2 |  30 |  11.7 |
|  4 |  10 |  6.5 |  40 |  18.2 |
|  5 |  12 |  7.8 |  50 |  26.0 |
|  6 |  14 |  9.1 |  60 |  35.1 |
|  7 |  17 | 11.0 |  70 |  46.1 |
|  8 |  20 | 13.0 |  80 |  59.1 |
|  9 |  25 | 16.2 |  90 |  75.3 |
| 10 |  38 | 24.7 | 100 | 100.0 |
|----+-----+------+-----+-------|
| 10 | 154 |      |     |       |
#+TBLFM: @>$1=vlen(@I..II)-1
#+TBLFM: @>$2=vsum(@I..II-1)
#+TBLFM: @2$3..@12$3=100 * $-1/@>$-1;%.1f
#+TBLFM: @2$4..@12$4=100 * $1/@>$1;%.0f
#+TBLFM: @2$5..@12$5=round(100 * vsum(@2$2..@0$2)/@>$2,1);%.1f


#+name: lorenz-csv
#+BEGIN_SRC elisp :var tab=tab-lorenz-data[0:-2,*] :results file none :file lorenz.csv :dir data/ :exports results :eval yes
  ;; write data for plots
  (orgtbl-to-csv tab nil)
#+END_SRC
